#Для записи строки, в которой не будет проводиться никакой специальной обработки, как, например, управляющих последовательностей, перед строкой указывается
#приставка "r" или "R". Например, r "Перевод строки обозначается \n"
#
#Замечание для пользователей регулярных выражений
#Для работы с регулярными выражениями всегда используйте необрабатываемые строки. В противном случае вас ждем много возни с обратными косыми чёрточками
#Например, обратные ссылки можно обозначить как '\\1' или r'\1'


