#Попробуйте ответить на вопрос: Как указать строку, содержащую одинарную кавычку (')?
#Например, "What's your name?". Python может не понять, где начало строки и её конец. Эта проблема устраняется с помощью управляющей последовательности
#Укажите одинарную кавычку как "\'" - через обратную косую черту. Теперь наша строка будет выглядеть так: 'What\'s your name'? 
#Другой способ записи такой строки связан с использованием двойных кавычек ("What's your name?")
#
#Сама же обратная наклонная черта указывается управляющей последовательностью (\\)
#
#Двустрочную строку можно заключить в тройные кавычки или использовать управляющую последовательность для символа переноса строки \n

#еще одна управляющая последовательность - символ табуляции (\t)

#одинарная наклонная черта в конце строки (\) указывает на то, что продолжение идет строкой ниже, но не вставляет перевода строки