def sayHello():
	print('Привет, Мир!') #блок, принадлежащий функции
#Конец функции

sayHello() #вызов функции
sayHello() #еще один вызов функции





#функции - это многократно используемые фрагменты программы. Они позволяют дать имя определенному блоку команд
#с тем, чтобы впоследствии запускать этот блок по указанному имени в любом месте программы и сколь угодно много раз.
#Это называется вызовом функции. Мы уже использовали много встроенных функций, как то len и range.

#функция - это, пожалуй, наиболее важный строительный блок любой нетривиальной программы (на любом языке программирования)

#функции определяются при помощи зарезервированного слова def. После этого слова указывается имя функции, за которым 
#следует пара скобок, в которых можно указать имена некоторых переменных, и заключительное двоеточие в конце строки.

input("\n\nНажмите Enter, чтобы выйти.")